In [1]:
import pandas as pd 
import numpy as np

In [46]:
data = pd.DataFrame(np.random.randint(1,100,(5,5)),index = 'A B C D E'.split(),columns = 'V W X Y Z'.split())
data

    V   W   X   Y   Z
A  16  48  49  73  95
B  35  37  92  61  22
C  25  91  66  12  17
D  39  23  15  80  69
E  93  36  58  76  24

In [47]:
# New = [1,2,3,4,5]
# data.loc['New']
data.loc['New']=[1,2,3,4,5]
data

      V   W   X   Y   Z
A    16  48  49  73  95
B    35  37  92  61  22
C    25  91  66  12  17
D    39  23  15  80  69
E    93  36  58  76  24
New   1   2   3   4   5

In [55]:
data['Baru']=np.random.rand(6)
data

      V   W   X   Y   Z      Baru
A    16  48  49  73  95  0.468638
B    35  37  92  61  22  0.969997
C    25  91  66  12  17  0.112535
D    39  23  15  80  69  0.473749
E    93  36  58  76  24  0.701357
New   1   2   3   4   5  0.055976

In [57]:
pd.concat([data,data.loc[['New']]])

      V   W   X   Y   Z      Baru
A    16  48  49  73  95  0.468638
B    35  37  92  61  22  0.969997
C    25  91  66  12  17  0.112535
D    39  23  15  80  69  0.473749
E    93  36  58  76  24  0.701357
New   1   2   3   4   5  0.055976
New   1   2   3   4   5  0.055976

In [53]:
type(data)

pandas.core.frame.DataFrame

In [62]:
#untuk masukin data di tengah
data.insert(3,'New2',np.random.rand(6))

In [63]:
data

      V   W   X      New2   Y   Z      Baru
A    16  48  49  0.176241  73  95  0.468638
B    35  37  92  0.855248  61  22  0.969997
C    25  91  66  0.174249  12  17  0.112535
D    39  23  15  0.803460  80  69  0.473749
E    93  36  58  0.606625  76  24  0.701357
New   1   2   3  0.832605   4   5  0.055976

In [67]:
data.insert(4,"New2",np.random.rand(6),allow_duplicates = False) #kalo mau jalan harus true supaya boleh duplicate

ValueError: cannot insert New2, already exists

In [68]:
data

      V   W   X      New2      New2   Y   Z      Baru
A    16  48  49  0.176241  0.610444  73  95  0.468638
B    35  37  92  0.855248  0.821583  61  22  0.969997
C    25  91  66  0.174249  0.510050  12  17  0.112535
D    39  23  15  0.803460  0.005630  80  69  0.473749
E    93  36  58  0.606625  0.128902  76  24  0.701357
New   1   2   3  0.832605  0.121358   4   5  0.055976

In [70]:
data.drop("Z",axis = 1)

      V   W   X      New2      New2   Y      Baru
A    16  48  49  0.176241  0.610444  73  0.468638
B    35  37  92  0.855248  0.821583  61  0.969997
C    25  91  66  0.174249  0.510050  12  0.112535
D    39  23  15  0.803460  0.005630  80  0.473749
E    93  36  58  0.606625  0.128902  76  0.701357
New   1   2   3  0.832605  0.121358   4  0.055976

In [71]:
data.drop("Baru",axis = 1,inplace = True)

In [72]:
data

      V   W   X      New2      New2   Y   Z
A    16  48  49  0.176241  0.610444  73  95
B    35  37  92  0.855248  0.821583  61  22
C    25  91  66  0.174249  0.510050  12  17
D    39  23  15  0.803460  0.005630  80  69
E    93  36  58  0.606625  0.128902  76  24
New   1   2   3  0.832605  0.121358   4   5

In [73]:
data.drop("E") #kalo kaya gini sifatnya ga permanent

      V   W   X      New2      New2   Y   Z
A    16  48  49  0.176241  0.610444  73  95
B    35  37  92  0.855248  0.821583  61  22
C    25  91  66  0.174249  0.510050  12  17
D    39  23  15  0.803460  0.005630  80  69
New   1   2   3  0.832605  0.121358   4   5

More about Index

In [76]:
data.reset_index() #kalo mau permanent, pake inplace = True

  index   V   W   X      New2      New2   Y   Z
0     A  16  48  49  0.176241  0.610444  73  95
1     B  35  37  92  0.855248  0.821583  61  22
2     C  25  91  66  0.174249  0.510050  12  17
3     D  39  23  15  0.803460  0.005630  80  69
4     E  93  36  58  0.606625  0.128902  76  24
5   New   1   2   3  0.832605  0.121358   4   5

In [75]:
data

      V   W   X      New2      New2   Y   Z
A    16  48  49  0.176241  0.610444  73  95
B    35  37  92  0.855248  0.821583  61  22
C    25  91  66  0.174249  0.510050  12  17
D    39  23  15  0.803460  0.005630  80  69
E    93  36  58  0.606625  0.128902  76  24
New   1   2   3  0.832605  0.121358   4   5

MULTI INDEX

In [79]:
Luar = ['Bandung','Bandung','Bandung','Bandung','Bandung','Bandung','Kendari','Kendari','Kendari','Kendari','Kendari','Kendari','Solo','Solo','Solo','Solo','Solo','Solo',]
Dalam = [1,2,3,4,5,6,1,2,3,4,5,6,1,2,3,4,5,6,]
Index = list(zip(Luar,Dalam))
Index

[('Bandung', 1),
 ('Bandung', 2),
 ('Bandung', 3),
 ('Bandung', 4),
 ('Bandung', 5),
 ('Bandung', 6),
 ('Kendari', 1),
 ('Kendari', 2),
 ('Kendari', 3),
 ('Kendari', 4),
 ('Kendari', 5),
 ('Kendari', 6),
 ('Solo', 1),
 ('Solo', 2),
 ('Solo', 3),
 ('Solo', 4),
 ('Solo', 5),
 ('Solo', 6)]

In [81]:
hier_index = pd.MultiIndex.from_tuples(Index)
hier_index

MultiIndex([('Bandung', 1),
            ('Bandung', 2),
            ('Bandung', 3),
            ('Bandung', 4),
            ('Bandung', 5),
            ('Bandung', 6),
            ('Kendari', 1),
            ('Kendari', 2),
            ('Kendari', 3),
            ('Kendari', 4),
            ('Kendari', 5),
            ('Kendari', 6),
            (   'Solo', 1),
            (   'Solo', 2),
            (   'Solo', 3),
            (   'Solo', 4),
            (   'Solo', 5),
            (   'Solo', 6)],
           )

In [86]:
df1 = pd.DataFrame(np.random.randint(1,100,(18,5)),index = hier_index,columns=['Cabang A','Cabang B','Cabang C','Cabang D','Cabang E'])
df1

           Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
Bandung 1        54        27        61        42        44
        2        96         2        98        84        68
        3        17        25        34        49        79
        4        99        72        53        37        36
        5        41        61         3        60        95
        6        38        10        38        91        79
Kendari 1        19        33        83        45        48
        2        97        58        79        13        10
        3        16        29        75        26        94
        4        40        60        40         9        70
        5        37        83        79        72         1
        6        58        10        25        44        81
Solo    1        82        32         6        62        51
        2        14        17        60        79        60
        3         2        49        86        59        43
        4        82        73        39        82        17
        5        57        65         7        67        75
        6        13        66        11        23        26

In [87]:
df1.loc["Kendari"]

   Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
1        19        33        83        45        48
2        97        58        79        13        10
3        16        29        75        26        94
4        40        60        40         9        70
5        37        83        79        72         1
6        58        10        25        44        81

In [88]:
df1.loc['Solo'].loc[6]

Cabang A    13
Cabang B    66
Cabang C    11
Cabang D    23
Cabang E    26
Name: 6, dtype: int32

In [92]:
df1.loc['Solo'].loc[[4,6]]

   Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
4        82        73        39        82        17
6        13        66        11        23        26

In [94]:
df1.xs(['Bandung',3])

Cabang A    17
Cabang B    25
Cabang C    34
Cabang D    49
Cabang E    79
Name: (Bandung, 3), dtype: int32

In [95]:
df1.index.names

FrozenList([None, None])

In [97]:
df1.index.names = ["Kota","Lokasi"]

In [98]:
df1

                Cabang A  Cabang B  Cabang C  Cabang D  Cabang E
Kota    Lokasi
Bandung 1             54        27        61        42        44
        2             96         2        98        84        68
        3             17        25        34        49        79
        4             99        72        53        37        36
        5             41        61         3        60        95
        6             38        10        38        91        79
Kendari 1             19        33        83        45        48
        2             97        58        79        13        10
        3             16        29        75        26        94
        4             40        60        40         9        70
        5             37        83        79        72         1
        6             58        10        25        44        81
Solo    1             82        32         6        62        51
        2             14        17        60        79        60
        3              2        49        86        59        43
        4             82        73        39        82        17
        5             57        65         7        67        75
        6             13        66        11        23        26

In [ ]:
 # Latihan 1
 - Insert data
 - Delete data
 - More About Index
 - Multi Index

 1. Buat sebuah data frame yg terdiri dari 5 baris 6 kolom namanya bebas. Nama kolom & indexnya bebas. isi dari setiap kolomnya coba dibedakan

In [122]:
col1 = np.random.rand(5)
col2 = np.random.randn(5)
col3 = np.ones(5)
col4 = np.random.randint(50,100,5)
col5 = np.random.randint(1,10,5)
col6 = np.linspace(1,10,5)
arr1 = pd.DataFrame(data=(zip(col1,col2,col3,col4,col5,col6)),index="A B C D E".split(),columns="K L M N O P".split())
arr1

          K         L    M   N  O      P
A  0.478506 -0.174411  1.0  51  9   1.00
B  0.683112  0.279500  1.0  71  7   3.25
C  0.344409  1.346264  1.0  95  6   5.50
D  0.213929  0.202872  1.0  52  7   7.75
E  0.743218  0.014926  1.0  94  9  10.00

2. dari dataframe yg dibuat, masukan sebuah kolom pada index ke 3 dan 0 yang nilainya adalah perkalian kolom index 0 awal dengan 10 (untuk kolom baru index 3) dan nilai mod dari index kolom 4 dan 5 pada kolom awal (untuk kolom baru index 0)

In [123]:
arr1.insert(3,'BARU1',arr1["K"]*10)

In [124]:
arr1.insert(0,"BARU2",(arr1["N"]%arr1["O"]))

3. tampilkan dataframe baru tsb

In [125]:
arr1

   BARU2         K         L    M     BARU1   N  O      P
A      6  0.478506 -0.174411  1.0  4.785061  51  9   1.00
B      1  0.683112  0.279500  1.0  6.831116  71  7   3.25
C      5  0.344409  1.346264  1.0  3.444085  95  6   5.50
D      3  0.213929  0.202872  1.0  2.139294  52  7   7.75
E      4  0.743218  0.014926  1.0  7.432183  94  9  10.00

4. coba tampilkan seluruh dataframe yang memiliki nilai >5. simpanlah kedalam sebuah dataframe baru

In [128]:
arr2 = arr1[(arr1>5)]
arr2

   BARU2   K   L   M     BARU1   N  O      P
A    6.0 NaN NaN NaN       NaN  51  9    NaN
B    NaN NaN NaN NaN  6.831116  71  7    NaN
C    NaN NaN NaN NaN       NaN  95  6   5.50
D    NaN NaN NaN NaN       NaN  52  7   7.75
E    NaN NaN NaN NaN  7.432183  94  9  10.00

5. dari dataframe baru pada nomor sebelumnya, hapuslah 2 kolom yg jumlahnya NA nya paling banyak. drop kolomnya secara permanent

In [130]:
arr2.drop(["K","L"],axis = 1,inplace = True)
arr2

   BARU2   M     BARU1   N  O      P
A    6.0 NaN       NaN  51  9    NaN
B    NaN NaN  6.831116  71  7    NaN
C    NaN NaN       NaN  95  6   5.50
D    NaN NaN       NaN  52  7   7.75
E    NaN NaN  7.432183  94  9  10.00

6. dari dataframe tsb, resetlah indexnya kemudian buatlah sebuah index baru

In [131]:
arr2.reset_index()

  index  BARU2   M     BARU1   N  O      P
0     A    6.0 NaN       NaN  51  9    NaN
1     B    NaN NaN  6.831116  71  7    NaN
2     C    NaN NaN       NaN  95  6   5.50
3     D    NaN NaN       NaN  52  7   7.75
4     E    NaN NaN  7.432183  94  9  10.00

In [145]:
arr2["new"] = ["satu","dua","tiga","empat","lima"]
arr2.set_index("new")

       BARU2   M     BARU1   N  O      P
new
satu     6.0 NaN       NaN  51  9    NaN
dua      NaN NaN  6.831116  71  7    NaN
tiga     NaN NaN       NaN  95  6   5.50
empat    NaN NaN       NaN  52  7   7.75
lima     NaN NaN  7.432183  94  9  10.00

7. bualah sebuah dataframe dgn multi index

In [133]:
luar = ["Suhu 1","Suhu 1","Suhu 1","Suhu 2","Suhu 2","Suhu 2","Suhu 3","Suhu 3","Suhu 3"]
dalam = ["20","30","40","20","30","40","20","30","40"]
index= list(zip(luar,dalam))
index

[('Suhu 1', '20'),
 ('Suhu 1', '30'),
 ('Suhu 1', '40'),
 ('Suhu 2', '20'),
 ('Suhu 2', '30'),
 ('Suhu 2', '40'),
 ('Suhu 3', '20'),
 ('Suhu 3', '30'),
 ('Suhu 3', '40')]

In [134]:
Hier_index = pd.MultiIndex.from_tuples(index)
Hier_index

MultiIndex([('Suhu 1', '20'),
            ('Suhu 1', '30'),
            ('Suhu 1', '40'),
            ('Suhu 2', '20'),
            ('Suhu 2', '30'),
            ('Suhu 2', '40'),
            ('Suhu 3', '20'),
            ('Suhu 3', '30'),
            ('Suhu 3', '40')],
           )

In [138]:
arr3 = pd.DataFrame(np.random.randint(100,200,(9,3)),index = Hier_index,columns=["10", "20", "30"])
arr3

            10   20   30
Suhu 1 20  154  174  107
       30  141  168  155
       40  186  113  169
Suhu 2 20  198  146  191
       30  182  121  196
       40  105  140  165
Suhu 3 20  156  112  146
       30  105  177  166
       40  174  141  197